import turtle

temperatury2017 = [-2.4, 	1.9, 	7.6, 	8.6, 	15.0, 	19.3, 	19.9, 	20.2, 	13.8, 	11.5, 	6.1, 	3.4] 
temperatury2018 = [3.3, 	-1.7, 	1.9, 	14.0, 	17.8, 	19.5, 	20.8, 	22.0, 	16.7, 	11.4, 	5.8,	3.3] 
temperatury2019 = [0.2, 	3.8, 	7.2, 	11.2, 	12.4, 	22.7, 	20.3, 	21.2, 	15.2, 	11.5,  7.6, 	4.0]

lista1 = [6,0,7, 1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,8, 3,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,3,2, 1,1,1,1,1,1,1,1,1,1,1,1,1,9,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1, 2,1,1,1,1,1,1]
lista2 = [6,0,7,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,2,1,2,1,4,1,4,1,2,1,2,1,4,1,4,1,2,1,2,1,4,1,4,1,2,1,2,1,4,1,4,1,2,1,2,1,4,1,4,1,2,1,2,1,4,1,4,1,2,1,2,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,2,8,1,1,1,4,1,1,4,1,1,1,9,2,1,2,6,1,1,1,1,1,1,7,77,1,4,1,8, 10,9,8,1,4,1,4,1,9,8,1,4,1,1,4,1,1,4,1,9,1,4,6,1,1,1,1,1,1,1,1,7,4, 77, 1,4,1,8, 10,9,8,1,4,1,4,1,9,8,1,4,1,1,4,1,1,4,1,9] #9
 
zolw = turtle.Turtle()
zolw.fillcolor('green')
zolw.color('green')
zolw.pensize(3)

#przeglądnij listę na dwa sposoby, używając for i while
# 1 to ruch do przodu o 50 pikseli - forward(50)
# 2 to skręt w lewo o 90 stopni - left(90)
# 3 to skręt w lewo o 45 stopni
# 4 to skręt w prawo o 90 stopni
# 5 to skręt w prawo o 45 stopni
# 6 to penup()
# 7 to pendown()
# 8 to begin_fill()
# 9 to end_fill()
# 10 to rysowanie koła - circle(50)
# 0 to ustawienie pozycji na -300, -300 czyli setpos(-300, -300)

        
